// ================== إعدادات المتجر ==================
// عدّل القيم دي على حسب متجرك

module.exports = {
  // اسم المنتج اللي هيظهر في الإعلان
  PRODUCT_NAME: "نيترو9 قيمنق شهري قفت 🚀",

  // السعر
  PRICE: "19.00 ريال",

  // رابط الشراء (تيكت أو رابط سيرفر التذاكر)
  PURCHASE_LINK: "https://discord.com/channels/1281538866238586902/1419643763915227136", // غيّره لرابط قناة التكت أو رابط الطلب

  // صورة المنتج (رابط مباشر لصورة)
  PRODUCT_IMAGE: "https://i.imgur.com/pxLdMmh.png",

  // اسم المتجر (يظهر في الفوتر)
  STORE_NAME: "Kovi Store",

  // آيدي روم التذاكر (اللي هيتعمل له منشن تحت الإعلان)
  TICKET_CHANNEL_ID: "1419643763915227136",

  // لون الإيمبد (هيكس كولور)
  EMBED_COLOR: "#B9AFCE",

  // آيدي الرول اللي مسموح له يستخدم أمر "متوفر" (عشان محدش يستخدمه غير الإدارة)
  // سيب المصفوفة فاضية [] لو عايز أي حد يقدر يستخدمه (مش منصوح بيه)
  ALLOWED_ROLE_IDS: ["1419640605432221696"],
};
